Revit 2024 API
ModelPath.CloudPath Property
 Whether this path represents a path on an Autodesk server such as BIM360.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public bool CloudPath { get; }
Visual Basic
Public ReadOnly Property CloudPath As Boolean
	Get
Visual C++
public:
property bool CloudPath {
	bool get ();
}
See Also
ModelPath Class
Autodesk.Revit.DB Namespace